{
  "_name_or_path": "/Users/anjanyelle/Desktop/untitled folder 3/Lakshya-LLM-Resume-Parser/ai-service/training/../models/deberta-v3-base-pretrained",
  "architectures": ["DebertaV2ForTokenClassification"],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-NAME",
    "2": "I-NAME",
    "3": "B-ORG",
    "4": "I-ORG",
    "5": "B-TITLE",
    "6": "I-TITLE",
    "7": "B-SKILL",
    "8": "I-SKILL",
    "9": "B-EDU",
    "10": "I-EDU",
    "11": "B-DATE",
    "12": "I-DATE",
    "13": "B-LOC",
    "14": "I-LOC"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DATE": 11,
    "B-EDU": 9,
    "B-LOC": 13,
    "B-NAME": 1,
    "B-ORG": 3,
    "B-SKILL": 7,
    "B-TITLE": 5,
    "I-DATE": 12,
    "I-EDU": 10,
    "I-LOC": 14,
    "I-NAME": 2,
    "I-ORG": 4,
    "I-SKILL": 8,
    "I-TITLE": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-7,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": ["p2c", "c2p"],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.0",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
